{"name":"Joseph","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Joseph Wathika, a","headerTaglineThree":"backend developer and API tester","headerTaglineFour":" based in Nairobi, Kenya","showCursor":false,"showBlog":true,"darkMode":true,"showResume":false,"socials":[{"id":"1","title":"Github","link":"https://github.com/wathika-eng"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/wathikaww/"},{"id":"025be7af-4771-4dd9-9782-c994e2ff0b12","title":"Email","link":"mailto:joseph_wathika@yahoo.com"}],"projects":[{"id":"1","title":"Uninotes Website","description":"Web Development","imageSrc":"https://i.imgur.com/cymRI9a.png","url":"https://uninotes-refactor.onrender.com/","technologies":["Django","Javascript"],"githublink":"https://github.com/wathika-eng/uninotes_refactor"},{"id":"2","title":"Uninotes Mobile App","description":"PWA","imageSrc":"https://i.imgur.com/8KrcsKq.png","url":"https://median.co/share/dqjowm"},{"id":"3","title":"Health Info System API","description":"API","imageSrc":"https://i.imgur.com/T1Kku0o.png","url":"https://github.com/wathika-eng/hims"},{"id":"4","title":"MoviePulse Website","description":"API integration with a frontend framework (React)","imageSrc":"https://i.imgur.com/DiJPZPJ.jpeg","url":"https://moviepulse-lyart.vercel.app/home"},{"id":"99300961-19aa-4662-a806-99c32e1c4a03","title":"CVE monitor bot","description":"API Integration with Telex (Slack clone)","imageSrc":"https://i.imgur.com/cZWvRvI.png","url":"https://github.com/telexintegrations/telex-cve-monitor"}],"services":[{"id":"1","title":"API Testing","description":"Ensure your applications run smoothly and reliably with thorough API testing. I offer comprehensive testing services to validate functionality, performance, security, and reliability of your APIs, helping you catch bugs early, ensure seamless integrations, and deliver a better user experience."},{"id":"2","title":"API Development & Integration","description":"Streamline communication between services with custom-built APIs and seamless third-party integrations. I design and implement RESTful and RPC APIs, and integrate external services like payment gateways, messaging platforms, and cloud/monitoring tools—enabling your application to work smarter and connect effortlessly."},{"id":"3","title":"Tech Support","description":"Get reliable technical assistance when you need it most with minimal resolution time. I provide fast and responsive support to troubleshoot software issues, guide users, resolve bugs, and ensure systems run smoothly helping individuals and teams stay productive and confident in their tech environments."},{"id":"4","title":"Backend Development","description":"Build robust, scalable, and secure server-side applications tailored to your business needs. I specialize in designing and developing APIs, managing databases, and implementing authentication systems ensuring your application's backbone is fast, reliable, and easy to maintain."},{"id":"82c338b0-27d1-4b16-a2d8-9abfe9d7a5a5","title":"Training & Mentorship","description":"I offer training for development teams on technologies like Golang, Django, Linux e.t.c"}],"aboutpara":"I specialize in backend development, API design and integration, and tech support, providing tailored solutions to help businesses build, optimize, and maintain robust systems. With expertise in Linux environments, cloud solutions, and database management, I offer reliable support for software troubleshooting, performance optimization, and secure, scalable architecture. Whether you're looking to develop custom solutions, improve your existing infrastructure, or need fast, responsive technical assistance, I’m here to help you stay productive and ahead of the curve.","resume":{"tagline":"👋 I'm a backend-focused software engineer and technical support specialist.","description":"I specialize in building scalable backend systems and providing technical support for E-Government and ERP systems. Proficient in Go, Python, and API testing, with a passion for ensuring system reliability and seamless user experiences.","experiences":[{"id":"1","dates":"September 2023 - Present","type":"Contract","position":"Technical Support at Kiambu County Government","bullets":["Conducted quality assurance, system testing, and API testing to ensure software functionality and integration with third-party services.","Developed technical documentation for software workflows, system configurations, and support procedures.","Facilitated ERP system training for end-users, focusing on custom modules to enhance system adoption.","Diagnosed and resolved ERP system issues, reducing downtime and improving operational efficiency."]},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"September 2020 - December 2023","type":"Volunteer","position":"Class Representative & Administrative Attaché","bullets":["Served as Class Representative, coordinating academic and administrative activities for peers.","Worked as an Administrative Attaché at the Ministry of Foreign & Diaspora Affairs, supporting administrative processes.","Acted as a Polling Clerk for IEBC, ensuring accurate and efficient electoral operations."]}],"education":{"universityName":"Jomo Kenyatta University of Agriculture and Technology","universityDate":"2020-2023","universityPara":"Earned a Bachelor's degree in Public Administration with a specialization in E-Government Systems. Gained expertise in Management Information Systems, public policy, and devolved governance, focusing on integrating technology to enhance government services."},"languages":["Go","Python","JavaScript","SQL","Bash"],"frameworks":["Django","Flask","React"],"others":["Docker","PostgreSQL","Linux","Git","Test Automation"]}}